# Advanced Dataframes

## Part 3 - Reshaping
- crosstab
- pivot_table

In [1]:
import pandas as pd
import numpy as np

np.random.seed(123)

In [2]:
# Create list of values for names column.
students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# Randomly generate arrays of scores for each student for each subject.
# Note that all the values need to have the same length here.
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

# Randomly generate if a student is in classroom A or classroom B
classroom = np.random.choice(['A', 'B'], len(students))

df = pd.DataFrame({'name':students,
                   'math':math_grades,
                   'reading':reading_grades,
                   'english':english_grades,
                   'room':classroom})

#calculated overall grade and letter
df['overall_grade'] = df[['math','reading','english']].mean(axis=1).round(1)
df['overall_letter'] = np.where(df.overall_grade >= 90, 'A', 
                                np.where(df.overall_grade >= 80, 'B','C'))

df

       name  math  reading  english room  overall_grade overall_letter
0     Sally    62       80       85    A           75.7              C
1      Jane    88       67       79    B           78.0              C
2     Suzie    94       95       74    A           87.7              B
3     Billy    98       88       96    B           94.0              A
4       Ada    77       98       92    A           89.0              B
5      John    79       93       76    B           82.7              B
6    Thomas    82       81       64    A           75.7              C
7     Marie    93       90       63    A           82.0              B
8    Albert    92       87       62    A           80.3              B
9   Richard    69       94       80    A           81.0              B
10    Isaac    92       93       99    B           94.7              A
11     Alan    92       72       62    A           75.3              C

## Using `.crosstab`
count the number of occurances between each subgroup
- format: `pd.crosstab(index=_, column=_)`

#### find all counts of the room and overall letter grade

#### add total counts

In [5]:
#margins

#### give percentages instead of counts

In [6]:
#normalize

### Using `.pivot_table`

creates a summary table similar to excel pivot table 

need to include 3 of the following:
- which values will make up the rows (the index)
- which values will make up the columns
- the values we are aggregating
- an aggregation method (aggfunc); if we can omit this, and mean will be used by default

format: `pd.pivot_table(data=_, index=_, columns=_, values=_, aggfunc=_)`

#### show the average math grade by overall letter grade and room

#### show the MAX math grade by overall letter grade and room

### Using `.map`

Use a dictionary to assign new values based on current values

- format: `.map({'old_value':'new_value'})`

#### create new df of restuarant data

In [8]:
n = 40

df = pd.DataFrame({
    'drink': np.random.choice(['Tea', 'Water', 'Water'], n),
    'meal': np.random.choice(['Curry', 'Yakisoba Noodle', 'Pad Thai'], n),
})

df.sample(10)

    drink             meal
11  Water  Yakisoba Noodle
17  Water         Pad Thai
30  Water            Curry
25    Tea         Pad Thai
29  Water         Pad Thai
34  Water            Curry
35    Tea  Yakisoba Noodle
12  Water            Curry
39    Tea         Pad Thai
33    Tea  Yakisoba Noodle

#### what are all unique drink values

#### what are all unique meal values

#### create dictionary of prices for all current items

In [10]:
prices = {
    'Yakisoba Noodle': 9,
    'Curry': 11,
    'Pad Thai': 10,
    'Tea': 2,
    'Water': 0,
}

#### map drink prices and meal prices to create bill

#### how many orders of each combination of meal and drink?

#### what percentage of each?

#### whats the average bill for each combination?

#### we can also get this by using a groupby